[
  {
    "category": "Romantic Partner Issues",
    "scenario": "He ghosts me every time we have a disagreement. I always end up apologizing, even when I don’t think I’m wrong.",
    "steps": [
      {
        "type": "intro",
        "bot": "Hey, I’m here for you. What’s on your mind?"
      },
      {
        "type": "context",
        "bot": "Okay 💛 So here’s the thing: when someone ghosts after conflict, it can be a form of emotional avoidance — and sometimes even emotional control, even if they don’t mean it that way. And when you always apologize first, it might be a sign of something called anxious attachment — where love feels tied to keeping the peace at all costs. It’s super common, especially when deep down you’re afraid of abandonment. But here’s what’s true: You deserve a relationship where your needs, voice, and boundaries matter too. Even during conflict."
      },
      {
        "type": "validation",
        "bot": "That sounds really painful. When someone disappears instead of talking things through, it can leave you feeling really alone and confused. You don’t deserve to carry the weight of every disagreement. Can I ask—how does it feel when that happens?",
        "options": [
          "I end up overthinking what I did wrong.",
          "I feel like I’m walking on eggshells.",
          "He says he just needs space.",
          "(Type your own...)"
        ]
      },
      {
        "type": "reflection",
        "user_choice": "I don’t want to lose him.",
        "bot": "That really hits deep. It sounds like staying connected—even at the cost of your own truth—feels safer than the idea of losing him. That’s such a human thing to do, especially when we care so much. But can I tell you something gently? When we constantly silence ourselves to keep someone, we slowly start losing ourselves instead. 💔 Would it be okay if I shared a little insight about what might be going on underneath this pattern?",
        "options": [
          "Yes, please.",
          "I’m not sure.",
          "Not right now."
        ]
      },
      {
        "type": "offer_support",
        "user_choice": "Yes, please.",
        "bot": "Would you like help putting your thoughts into a message that feels clear but not confrontational?",
        "options": [
          "Yes, that would help a lot.",
          "Maybe… can I see an example first?",
          "No, I’m not ready to send anything.",
          "(Type your own...)"
        ]
      },
      {
        "type": "sample_message",
        "user_choice": "Yes, that would help a lot.",
        "bot": "I got you 🤝 Let’s craft something that’s honest, calm, and clear — something that lets you express how you feel without starting a fight. Here’s one way to say it:\n\n“Hey, I care about us and wanted to be honest. When we have a disagreement and you disappear, I feel really hurt and unsure of where we stand. I find myself apologizing just to reconnect, even when I’m not sure I did anything wrong. I’d really appreciate if we could talk things through, even when it’s hard — that would help me feel safer and more respected in this relationship.”\n\n💬 You can:\n✏️ Edit this to make it feel more you\n💡 Ask for a different tone (softer or more assertive)\n💾 Save it for later\n\nWas this helpful?",
        "options": [
          "Yes",
          "No"
        ]
      }
    ]
  },
  {
    "category": "Friendship Challenges",
    "scenario": "My friend makes jokes about things I'm insecure about. When I speak up, she says I'm too sensitive.",
    "steps": [
      {
        "type": "intro",
        "bot": "Hey, I’m here for you. What’s going on with your friend?"
      },
      {
        "type": "context",
        "bot": "Okay 💛 That kind of situation can really wear you down. When someone makes jokes about things you’re insecure about — especially someone you care about — it can blur the line between teasing and harm. And when you speak up and they tell you you’re ‘too sensitive,’ it can make you question your own feelings. That’s not okay. Your feelings are valid. You deserve friendships where you feel safe, not small."
      },
      {
        "type": "validation",
        "bot": "That sounds really hurtful. Being mocked about something you're already insecure about can cut deep, especially when it's brushed off as 'just a joke.' Can I ask—what usually happens after she says you're too sensitive?",
        "options": [
          "I stay quiet to avoid more drama.",
          "I try to laugh it off but it hurts.",
          "I start doubting myself.",
          "(Type your own...)"
        ]
      },
      {
        "type": "reflection",
        "user_choice": "I try to laugh it off but it hurts.",
        "bot": "That makes total sense. Sometimes it feels easier to pretend it's no big deal than risk a bigger conflict. But just because you don’t show your hurt doesn’t mean it isn’t real. And pretending doesn’t make it go away — it just pushes it deeper. Can I ask—what do you wish would happen instead when you speak up?",
        "options": [
          "I wish she would actually listen.",
          "I just want her to stop.",
          "I want to feel respected, not judged.",
          "I honestly don’t know."
        ]
      },
      {
        "type": "offer_support",
        "user_choice": "I wish she would actually listen.",
        "bot": "That’s a completely reasonable hope. You deserve to be heard and supported by your friends. Would you like help crafting a message that sets a gentle boundary but also shows you care?",
        "options": [
          "Yes, that would help a lot.",
          "Maybe… can I see an example first?",
          "No, I’m not ready to say anything.",
          "(Type your own...)"
        ]
      },
      {
        "type": "sample_message",
        "user_choice": "Yes, that would help a lot.",
        "bot": "Got you 🤝 Here's a message you could start with:\n\n“Hey, I wanted to share something that’s been bothering me. When you joke about things I’m insecure about, it really hurts — even if it’s meant to be funny. I know you might not mean it that way, but it makes me feel small. I’d appreciate it if we could be more mindful — I really value our friendship and want it to feel safe and supportive.”\n\n💬 You can:\n✏️ Tweak it to make it feel more like you\n💡 Ask for a different tone (more assertive or more gentle)\n💾 Save it for later\n\nWas this helpful?",
        "options": [
          "Yes",
          "No"
        ]
      }
    ]
  }
]